healthy-back-end-app/app/controllers/menus_controller.rb

SELECT "menus".* FROM "menus"
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @menus = Menu.all
    menus =  @menus.map { |menu| {menu: menu , restaurant: menu.restaurant.name} }

INSERT INTO "menus" ("restaurant_id", "price", "calories", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["restaurant_id", 1], ["price", 232.878], ["calories", 232.0], ["description", "ff"], ["created_at", "2019-02-05 11:26:14.221221"], ["updated_at", "2019-02-05 11:26:14.221221"]]
---
  def create
    @menu = Menu.create(menu_params)