healthy-back-end-app/app/controllers/restaurants_controller.rb

def index
  @restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"