healthy-back-end-app/app/controllers/users_controller.rb

INSERT INTO "users" ("firstt_name", "last_name", "email", "password_digest", "auth_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create

    puts "\n\n\n\n\n" , user_params
    @user = User.create!(user_params)